Enums/ТипыРеквизитовДляРасчетаПособияФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыРеквизитовДляРасчетаПособияФСС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НомерЭЛН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрационныйНомерФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСовместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодПодчиненностиФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникКатегория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникСНИЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникИНН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникФИО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникДатаРождения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникПол</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникНалогоплательщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникУдостоверениеЛичности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпособВыплатыПособия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГодыДляРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РайонныйКоэффициентРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоляВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховойСтаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НестраховойСтаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УсловияИсчисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льготы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодОплатыЗаСчетФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключаемыеПериоды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодыПростоя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоУходу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УсыновлениеОпека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаВоспитание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияОРожденииРебенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СправкаОтДругогоРодителя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыРеквизитовДляРасчетаПособияФСС/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СоответствиеДляПоискаПоИменам() Экспорт
	Результат = Новый Соответствие;
	Результат.Вставить(НРег("elnInfo.code"), НомерЭЛН);
	
	Результат.Вставить(НРег("insurerInfo.regNum"), РегистрационныйНомерФСС);
	Результат.Вставить(НРег("insurerInfo.partTime"), ВнешнееСовместительство);
	Результат.Вставить(НРег("insurerInfo.parentNo"), КодПодчиненностиФСС);
	
	Результат.Вставить(НРег("insuredInfo.category"), СотрудникКатегория);
	Результат.Вставить(НРег("insuredInfo.snils"), СотрудникСНИЛС);
	Результат.Вставить(НРег("insuredInfo.inn"), СотрудникИНН);
	Результат.Вставить(НРег("insuredInfo.fullName"), СотрудникФИО);
	Результат.Вставить(НРег("insuredInfo.birthDate"), СотрудникДатаРождения);
	Результат.Вставить(НРег("insuredInfo.gender"), СотрудникПол);
	Результат.Вставить(НРег("insuredInfo.taxpayer"), СотрудникНалогоплательщик);
	Результат.Вставить(НРег("insuredInfo.id"), СотрудникУдостоверениеЛичности);
	Результат.Вставить(НРег("insuredInfo.workContract"), СотрудникТрудовойДоговор);
	
	Результат.Вставить(НРег("receivePayment"), СпособВыплатыПособия);
	
	Результат.Вставить(НРег("calculationData.years.changeYear"), ГодыДляРасчета);
	Результат.Вставить(НРег("calculationData.years.year.calc"), ГодыДляРасчета);
	Результат.Вставить(НРег("calculationData.years.year.baseSum"), ГодыДляРасчета);
	Результат.Вставить(НРег("calculationData.kfReg"), РайонныйКоэффициентРФ);
	Результат.Вставить(НРег("calculationData.kfShortDays"), ДоляВремени);
	Результат.Вставить(НРег("calculationData.experience.insurYY"), СтраховойСтаж);
	Результат.Вставить(НРег("calculationData.experience.insurMM"), СтраховойСтаж);
	Результат.Вставить(НРег("calculationData.experience.notInsurYY"), НестраховойСтаж);
	Результат.Вставить(НРег("calculationData.experience.notInsurMM"), НестраховойСтаж);
	Результат.Вставить(НРег("calculationData.calcConditionList.calcCondition"), УсловияИсчисления);
	Результат.Вставить(НРег("calculationData.causeRadiation"), Льготы);
	Результат.Вставить(НРег("calculationData.payPeriodFSS.begin"), ПериодОплатыЗаСчетФСС);
	Результат.Вставить(НРег("calculationData.payPeriodFSS.end"), ПериодОплатыЗаСчетФСС);
	Результат.Вставить(НРег("calculationData.excludePeriodList.excludePeriod.type"), ИсключаемыеПериоды);
	Результат.Вставить(НРег("calculationData.excludePeriodList.excludePeriod.period"), ИсключаемыеПериоды);
	Результат.Вставить(НРег("calculationData.downPeriodList.downPeriod.period"), ПериодыПростоя);
	Результат.Вставить(НРег("calculationData.downPeriodList.downPeriod.idleAverage"), ПериодыПростоя);
	
	
	Результат.Вставить(НРег("vacation"), ОтпускПоУходу);
	
	
	Результат.Вставить(НРег("wardInfo"), УсыновлениеОпека);
	Результат.Вставить(НРег("refFamilyInfo"), ПередачаНаВоспитание);
	Результат.Вставить(НРег("birthInfo"), ИнформацияОРожденииРебенка);
	Результат.Вставить(НРег("refNpayOther"), СправкаОтДругогоРодителя);
	Результат.Вставить(НРег("otherMissing"), СправкаОтДругогоРодителя);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
